src/Documents/УведомлениеОВыдачеВОтделенияМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УведомлениеОВыдачеВОтделенияМДЛП</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеУведомленияОВыдачеВОтделенияМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаДеятельностиМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерДокументаМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеПодтверждения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияПодтвержденияМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПередачаСведенийЧерезСКЗКМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеПолученыИзМДЛП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СерияНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GTIN</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПервичныхУпаковокВоВторичной</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НомераУпаковок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерКИЗ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НомерУпаковкиМДЛП</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляОтВторичнойУпаковки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отклонено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтказа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПервичныхУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихкодBase64</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПояснениеСтатусаПроверкиСКЗКМ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЛокальнойПроверкиСКЗКМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПодтверждения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияПодтвержденияМДЛП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/СостоянияПодтвержденияМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияПодтвержденияМДЛП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготовленоКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Передано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятоГИСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненоГИСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтвердить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвердитьПодготовленоКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвердитьПередано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвердитьПринятоГИСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвердитьОтклоненоГИСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтверждено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отозвать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтозватьПодготовленоКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтозватьПередано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтозваноПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтозватьОтклоненоГИСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказаться</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказатьсяПодготовленоКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказатьсяПередано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненоПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказатьсяОтклоненоГИСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеТребуется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыОбработкиСообщенийМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыОбработкиСообщенийМДЛП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Передано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятоЧастично</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыСообщенийМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыСообщенийМДЛП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квитанция</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыИнформированияМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыИнформированияМДЛП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отсутствует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Передано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятоИзМДЛП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаОтменуПроведенияКПередаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаОтменуПроведенияПередан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаОтменуПроведенияОшибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтверждено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыто</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ДальнейшиеДействияПоВзаимодействиюМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ДальнейшиеДействияПоВзаимодействиюМДЛП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыполнитеОбмен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнитеПроверку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закройте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапроситеИнформациюОКиЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеТребуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеПередачуДанныхРегламентнымЗаданием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеПолучениеИнформации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеПолучениеКвитанцииОФиксации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидайтеПолученияПодтверждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОприходуйтеБезПодтверждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтзовитеОперацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтзовитеПереданныйТовар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОткажитесьОтПриемкиТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитеПередачуДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередайтеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтвердитеПолучение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/УведомлениеОВыдачеВОтделенияМДЛП/Ext/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	ИнтеграцияМДЛПВызовСервера.ПриПолученииФормыДокумента(
		ПустаяСсылка(), ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ДействияПриОбмене

Функция ОбновитьСтатусПослеПодготовкиКПередачеДанных(ДокументСсылка, Операция) Экспорт
	
	Возврат ИнтеграцияМДЛП.ОбновитьСтатусПослеПодготовкиКПередачеДанных(ДокументСсылка, Операция);
	
КонецФункции

Функция ОбновитьСтатусПослеПередачиДанных(ДокументСсылка, Операция, СтатусОбработки) Экспорт
	
	Возврат ИнтеграцияМДЛП.ОбновитьСтатусПослеПередачиДанных(ДокументСсылка, Операция, СтатусОбработки);
	
КонецФункции

Функция ОбновитьСтатусПослеПолученияДанных(ДокументСсылка, Операция, ДанныеКвитанции) Экспорт
	
	Возврат ИнтеграцияМДЛП.ОбновитьСтатусПослеПолученияДанных(ДокументСсылка, Операция, ДанныеКвитанции);
	
КонецФункции

Процедура ОбновитьСостояниеПодтверждения(ДокументОбъект, Операция, Сообщение, СтатусОбработки, ОтклоненныеНомера = Неопределено) Экспорт
	
	ПараметрыОбновления = ИнтеграцияМДЛП.СостояниеПодтверждения(Операция, Сообщение, СтатусОбработки);
	
	Если ПараметрыОбновления = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Операция = Перечисления.ОперацииОбменаМДЛП.Получение_ВыдачаЛПДляОказанияМедицинскойПомощиСКЗКМ Тогда
		
		ТекстСообщения = ИнтеграцияМДЛПВызовСервера.ТекстСообщенияИзПротокола(Сообщение);
		ОбъектXDTO = ИнтеграцияМДЛП.ПолучитьОбъектXDTOИзТекстаСообщения(ТекстСообщения);
		
		КонечныеСостояния = Новый Массив;
		КонечныеСостояния.Добавить(Перечисления.СостоянияПодтвержденияМДЛП.Подтверждено);
		
		СписокТоваров = ОбъектXDTO.skzkm_health_care.order_details.union;
		Для Каждого Данные Из СписокТоваров Цикл
			НомерУпаковки = Данные.sgtin;
			Строка = ДокументОбъект.НомераУпаковок.Найти(НомерУпаковки, "НомерКиЗ");
			Если КонечныеСостояния.Найти(Строка.СостояниеПодтверждения) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ОтклоненныеНомера = Неопределено Или ОтклоненныеНомера[НомерУпаковки] = Неопределено Тогда
				Строка.СостояниеПодтверждения = ПараметрыОбновления.Состояние;
			Иначе
				Строка.Отклонено = Истина;
				Строка.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.ОтклоненоГИСМ;
				Строка.ПричинаОтказа = ИнтеграцияМДЛП.ПредставлениеПричиныОтклонения(ОтклоненныеНомера[НомерУпаковки]);
			КонецЕсли;
		КонецЦикла;
		
		НовоеСостояние = Перечисления.СостоянияПодтвержденияМДЛП.ОтклоненоГИСМ;
		Для Каждого Строка Из ДокументОбъект.НомераУпаковок Цикл
			Если Строка.СостояниеПодтверждения <> Перечисления.СостоянияПодтвержденияМДЛП.ОтклоненоГИСМ
			   И Строка.СостояниеПодтверждения <> Перечисления.СостоянияПодтвержденияМДЛП.ПринятоГИСМ Тогда
				НовоеСостояние = Перечисления.СостоянияПодтвержденияМДЛП.Передано;
				Прервать;
			КонецЕсли;
			Если Строка.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.ПринятоГИСМ Тогда
				НовоеСостояние = Перечисления.СостоянияПодтвержденияМДЛП.ПринятоГИСМ;
			КонецЕсли;
		КонецЦикла;
		
		ДокументОбъект.СостояниеПодтверждения = НовоеСостояние;
		
	Иначе
		
		ДокументОбъект.СостояниеПодтверждения = ПараметрыОбновления.Состояние;
		
		Если ДокументОбъект.СостояниеПодтверждения <> Перечисления.СостоянияПодтвержденияМДЛП.ОтклоненоГИСМ Тогда
			
			Если ЗначениеЗаполнено(ОтклоненныеНомера) Тогда
				
				Для Каждого Номер Из ОтклоненныеНомера Цикл
					НомерУпаковкиИлиИндекс = Номер.Ключ;
					Если ТипЗнч(НомерУпаковкиИлиИндекс) = Тип("Число") Тогда
						Строка = ДокументОбъект.НомераУпаковок[НомерУпаковкиИлиИндекс];
					Иначе
						Строка = ДокументОбъект.НомераУпаковок.Найти(НомерУпаковкиИлиИндекс, "НомерКиЗ");
					КонецЕсли;
					Строка.Отклонено = Истина;
					Строка.ПричинаОтказа = ИнтеграцияМДЛП.ПредставлениеПричиныОтклонения(Номер.Значение);
					Строка.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.ОтклоненоГИСМ;
				КонецЦикла;
				
			КонецЕсли;
			
			Если Операция = Перечисления.ОперацииОбменаМДЛП.ПередачаДанных_ВыдачаЛПДляОказанияМедицинскойПомощиСКЗКМ
			   И СтатусОбработки = Перечисления.СтатусыОбработкиСообщенийМДЛП.Принято Тогда
				Для Каждого Строка Из ДокументОбъект.НомераУпаковок Цикл
					Строка.ШтрихкодBase64 = "";
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Определить необходимость перерасчета статуса оформления документов.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.УведомлениеОРозничнойПродажеМДЛП - 
//  Документ, по которому требуется рассчитать статус оформления.
//  ПредыдущийСтатус - ПеречислениеСсылка.СтатусыОбработки - Предыдущий статус.
//  НовыйСтатус - ПеречислениеСсылка.СтатусыОбработки - Новый статус.
// 
// Возвращаемое значение:
//  Булево - Необходимость перерасчета статуса оформления.
//
Функция РассчитатьСтатусОформления(ДокументСсылка, ПредыдущийСтатус, НовыйСтатус) Экспорт
	
	Основание = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Основание");
	Если ЗначениеЗаполнено(Основание) Тогда
		ИнтеграцияМДЛППереопределяемый.РассчитатьСтатусОформленияУведомленияОВыдачеВОтделения(Основание);
	КонецЕсли;
	
КонецФункции

// Получить последовательность операций в течении жизненного цикла документа.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. функцию ИнтеграцияМДЛП.ПустаяТаблицаПоследовательностьОпераций().
//
Функция ПоследовательностьОпераций(ДокументСсылка) Экспорт
	
	Таблица = ИнтеграцияМДЛП.ПустаяТаблицаПоследовательностьОпераций();
	
	Исходящее = Перечисления.ТипыСообщенийМДЛП.Исходящее;
	
	ПередачаСведенийЧерезСКЗКМ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ПередачаСведенийЧерезСКЗКМ");
	Если ПередачаСведенийЧерезСКЗКМ = Истина Тогда
		ИнтеграцияМДЛП.ДобавитьОперациюВПоследовательность(Таблица, 0, Исходящее, Перечисления.ОперацииОбменаМДЛП.ПередачаДанных_ВыдачаЛПДляОказанияМедицинскойПомощиСКЗКМ);
		Операция = ИнтеграцияМДЛП.ДобавитьОперациюВПоследовательность(Таблица, 0, Исходящее, Перечисления.ОперацииОбменаМДЛП.Получение_ВыдачаЛПДляОказанияМедицинскойПомощиСКЗКМ);
		Операция.КвитанцияПринят = Ложь;
	Иначе
		ИнтеграцияМДЛП.ДобавитьОперациюВПоследовательность(Таблица, 0, Исходящее, Перечисления.ОперацииОбменаМДЛП.ПередачаДанных_ВыдачаЛПДляОказанияМедицинскойПомощи);
	КонецЕсли;
	
	Возврат Таблица;
	
КонецФункции

#КонецОбласти

#Область Статусы

// Возвращает статус информирования по умолчанию.
// 
// Возвращаемое значение:
//  Перечисления.СтатусыИнформированияМДЛП - Статус по-умолчанию.
//
Функция СтатусИнформированияПоУмолчанию() Экспорт
	
	Возврат Перечисления.СтатусыИнформированияМДЛП.Черновик;
	
КонецФункции

// Возвращает дальнейшее действие по умолчанию.
// 
// Возвращаемое значение:
//  Перечисления.ДальнейшиеДействияПоВзаимодействиюМДЛП - Дальнейшее действие по-умолчанию.
//
Функция ДальнейшееДействиеПоУмолчанию() Экспорт
	
	Возврат Перечисления.ДальнейшиеДействияПоВзаимодействиюМДЛП.ПередайтеДанные;
	
КонецФункции

// Возвращает запрос для получения статуса оформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Документ основание.
// 
// Возвращаемое значение:
//  Запрос - Запрос для получения статуса оформления.
//
Функция ЗапросСтатусаОформления(ДокументОснование) Экспорт
	
	Запрос = ИнтеграцияМДЛППереопределяемый.ЗапросСтатусаОформленияУведомленияОВыдачеВОтделения(ДокументОснование);
	
	Возврат Запрос;
	
КонецФункции

#КонецОбласти

#Область ПанельМаркировкиМДЛП

Функция ВсеТребующиеДействия(Все = Ложь) Экспорт
	
	Действия = Новый Массив;
	Действия.Добавить(Перечисления.ДальнейшиеДействияПоВзаимодействиюМДЛП.ПередайтеДанные);
	Если Все Или Не ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическуюОтправкуПолучениеДанныхМДЛП") Тогда
		Действия.Добавить(Перечисления.ДальнейшиеДействияПоВзаимодействиюМДЛП.ВыполнитеОбмен);
	КонецЕсли;
	
	Возврат Действия;
	
КонецФункции

Функция ВсеТребующиеОжидания(Все = Ложь) Экспорт
	
	Действия = Новый Массив;
	Действия.Добавить(Перечисления.ДальнейшиеДействияПоВзаимодействиюМДЛП.ОжидайтеПолучениеКвитанцииОФиксации);
	Если Все Или ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическуюОтправкуПолучениеДанныхМДЛП") Тогда
		Действия.Добавить(Перечисления.ДальнейшиеДействияПоВзаимодействиюМДЛП.ОжидайтеПередачуДанныхРегламентнымЗаданием);
	КонецЕсли;
	
	Возврат Действия;
	
КонецФункции

Процедура ПриЗаполненииДокументовПанелиМаркировкиМДЛП(ТаблицаДокументы) Экспорт
	
	Описание = ИнтеграцияМДЛП.ДобавитьДокументНаПанельМаркировки(
		ТаблицаДокументы,
		Метаданные.Документы.УведомлениеОВыдачеВОтделенияМДЛП,
		НСтр("ru = 'Выдача для оказания мед. помощи'"),
		ИнтеграцияМДЛПКлиентСервер.ПанельМаркировкаРазделСклад());
	
	Описание.Оформите    = Истина;
	Описание.Отработайте = Истина;
	Описание.Ожидайте    = Истина;
	
	Описание.Порядок = 40;
	
КонецПроцедуры

// Возвращает текст запроса для получения количества документов для оформления
// 
// Возвращаемое значение:
//  Строка - Текст запроса
//
Функция ПанельМаркировкиМДЛПТекстЗапросаОформите() Экспорт
	
	Возврат ИнтеграцияМДЛППереопределяемый.УведомлениеОВыдачеВОтделенияТекстЗапросаОформите();
	
КонецФункции

// Возвращает текст запроса для получения количества документов для отработки
// 
// Возвращаемое значение:
//  Строка - Текст запроса
//
Функция ПанельМаркировкиМДЛПТекстЗапросаОтработайте() Экспорт
	
	Возврат Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаОтработайте(Метаданные.Документы.УведомлениеОВыдачеВОтделенияМДЛП);
	
КонецФункции

// Возвращает текст запроса для получения количества документов, находящихся в состоянии ожидания
// 
// Возвращаемое значение:
//  Строка - Текст запроса
//
Функция ПанельМаркировкиМДЛПТекстЗапросаОжидайте() Экспорт
	
	Возврат Обработки.ПанельМаркировкиМДЛП.ТекстЗапросаОжидайте(Метаданные.Документы.УведомлениеОВыдачеВОтделенияМДЛП);
	
КонецФункции

#КонецОбласти

#Область СообщениеМДЛП

Функция СообщениеКПередаче(ДокументСсылка, ДальнейшееДействие, ДополнительныеПараметры = Неопределено) Экспорт
	
	Возврат УведомлениеОВыдачеВОтделенияДляОказанияМедицинскойПомощи(ДокументСсылка);
	
КонецФункции

Функция ОпределитьДокументыДляЗагрузки(ДанныеДокумента, Операция) Экспорт
	
	Если Операция = Перечисления.ОперацииОбменаМДЛП.Получение_ВыдачаЛПДляОказанияМедицинскойПомощиСКЗКМ Тогда
		Возврат ОпределитьУведомлениеОВыдаче(ДанныеДокумента);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ЗагрузитьВходящееСообщение(ДанныеДокумента, Операция, ДокументСсылка) Экспорт
	
	Если Операция = Перечисления.ОперацииОбменаМДЛП.Получение_ВыдачаЛПДляОказанияМедицинскойПомощиСКЗКМ Тогда
		ЗагрузитьУведомлениеОВыдаче(ДанныеДокумента, ДокументСсылка);
	Иначе
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Неизвестная операция %1'"), Операция);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Возвращает данные для заполнения представления документа.
//
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//  * КомандаСоздать - Строка - Представление документа, если документ требуется создать.
//  * ИмяКомандыСоздать - Строка - Имя команды "Создать".
//  * ИмяКомандыОткрыть - Строка - Имя команды "Открыть".
//  * ДокументОтсутствуетНетПравНаСоздание - Строка - Представление документа, если документ не создан.
//  * Представление - Строка - Представление документа.
//  * НесколькоДокументовПредставление - Строка - Представление документа, если их несколько.
//
Функция ПредставлениеДокумента() Экспорт
	
	ВозвращаемоеЗначение = ИнтеграцияМДЛП.ПустоеПредставлениеДокумента();
	ВозвращаемоеЗначение.КомандаСоздать                       = НСтр("ru = 'Создать уведомление о выдаче в отделение МДЛП'");
	ВозвращаемоеЗначение.ИмяКомандыСоздать                    = "СоздатьУведомлениеОВыдачеВОтделенияМДЛП";
	ВозвращаемоеЗначение.ИмяКомандыОткрыть                    = "ОткрытьУведомлениеОВыдачеВОтделенияМДЛП";
	ВозвращаемоеЗначение.ДокументОтсутствуетНетПравНаСоздание = НСтр("ru = 'Уведомление о выдаче в отделение МДЛП не создано'");
	ВозвращаемоеЗначение.Представление                        = НСтр("ru = 'Уведомление о выдаче в отделение МДЛП: %1'");
	ВозвращаемоеЗначение.НесколькоДокументовПредставление     = НСтр("ru = 'Уведомление о выдаче в отделение МДЛП (%1)'");
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПоддерживаетЗагрузкуУведомлений() Экспорт
	Возврат Истина;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УведомлениеОВыдачеВОтделенияДляОказанияМедицинскойПомощи(ДокументСсылка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Сообщения = Новый Массив;
	
	СообщениеКПередаче = ИнтеграцияМДЛП.СтруктураСообщенияКПередаче();
	СообщениеКПередаче.Документ = ДокументСсылка;
	СообщениеКПередаче.Операция = Перечисления.ОперацииОбменаМДЛП.ПередачаДанных_ВыдачаЛПДляОказанияМедицинскойПомощи;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Шапка.Организация.ВерсияСхемОбмена     КАК ВерсияСхемОбмена,
	|	Шапка.Ссылка                           КАК Ссылка,
	|	Шапка.Основание                        КАК Основание,
	|	Шапка.Дата                             КАК Дата,
	|	Шапка.МестоДеятельности.Идентификатор  КАК ИдентификаторМестаДеятельности,
	|	Шапка.НомерДокумента                   КАК НомерДокумента,
	|	Шапка.ДатаДокумента                    КАК ДатаДокумента,
	|	Шапка.ПередачаСведенийЧерезСКЗКМ       КАК ПередачаСведенийЧерезСКЗКМ
	|ИЗ
	|	Документ.УведомлениеОВыдачеВОтделенияМДЛП КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка = &Ссылка
	|	И Шапка.СостояниеПодтверждения = ЗНАЧЕНИЕ(Перечисление.СостоянияПодтвержденияМДЛП.КПередаче)
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.GTIN                                    КАК GTIN,
	|	НомераУпаковок.НомерКИЗ                        КАК НомерКИЗ,
	|	НомераУпаковок.ДоляОтВторичнойУпаковки         КАК ДоляОтВторичнойУпаковки,
	|	НомераУпаковок.КоличествоПервичныхУпаковок     КАК КоличествоПервичныхУпаковок,
	|	Товары.КоличествоПервичныхУпаковокВоВторичной  КАК КоличествоПервичныхУпаковокВоВторичной
	|ИЗ
	|	Документ.УведомлениеОВыдачеВОтделенияМДЛП.Товары КАК Товары
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.УведомлениеОВыдачеВОтделенияМДЛП.НомераУпаковок КАК НомераУпаковок
	|	ПО
	|		НомераУпаковок.Ссылка = Товары.Ссылка
	|		И НомераУпаковок.ИдентификаторСтроки = Товары.ИдентификаторСтроки
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|");
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	
	Результат = Запрос.ВыполнитьПакет();
	Шапка    = Результат[0].Выбрать();
	Товары   = Результат[1].Выгрузить();
	
	Если Не Шапка.Следующий() Или Товары.Количество() = 0 Тогда
		
		ИнтеграцияМДЛПКлиентСервер.ДобавитьТекстОшибки(СообщениеКПередаче, НСтр("ru = 'Нет данных для выгрузки.'"));
		Сообщения.Добавить(СообщениеКПередаче);
		Возврат Сообщения;
		
	КонецЕсли;
	
	Если Не Шапка.ПередачаСведенийЧерезСКЗКМ Тогда
		ТекстСообщения = УведомлениеОВыдачеВОтделенияДляОказанияМедицинскойПомощиМДЛП(Шапка, Товары, СообщениеКПередаче);
	Иначе
		ТекстСообщения = УведомлениеОВыдачеВОтделенияДляОказанияМедицинскойПомощиСКЗКМ(Шапка, Товары, СообщениеКПередаче);
		СообщениеКПередаче.Операция = Перечисления.ОперацииОбменаМДЛП.ПередачаДанных_ВыдачаЛПДляОказанияМедицинскойПомощиСКЗКМ;
	КонецЕсли;
	
	СообщениеКПередаче.ТекстСообщения = ТекстСообщения;
	СообщениеКПередаче.ИдентификаторСубъектаОбращения = Шапка.ИдентификаторМестаДеятельности;
	СообщениеКПередаче.Основание      = Шапка.Основание;
	СообщениеКПередаче.ТипСообщения   = Перечисления.ТипыСообщенийМДЛП.Исходящее;
	СообщениеКПередаче.ОбновитьСостояниеПодтверждения = Истина;
	СообщениеКПередаче.ПередачаСведенийЧерезСКЗКМ = Шапка.ПередачаСведенийЧерезСКЗКМ;
	
	Сообщения.Добавить(СообщениеКПередаче);
	Возврат Сообщения;
	
КонецФункции

Функция УведомлениеОВыдачеВОтделенияДляОказанияМедицинскойПомощиМДЛП(Шапка, Товары, СообщениеКПередаче)
	
	ПространствоИмен = ИнтеграцияМДЛП.ПространствоИмен(Шапка.ВерсияСхемОбмена);
	
	УстановленныеДаты = Новый Соответствие;
	
	ИмяТипа   = "documents";
	ИмяПакета = "health_care";
	
	ПередачаДанных = ИнтеграцияМДЛП.ОбъектXDTOПоИмениСвойства(Неопределено, ИмяТипа, ПространствоИмен);
	ИнтеграцияМДЛП.УстановитьВерсиюСхемОбменаПакета(ПередачаДанных);
	
	Уведомление = ИнтеграцияМДЛП.ОбъектXDTOПоИмениСвойства(ПередачаДанных, ИмяПакета);
	ПередачаДанных[ИмяПакета] = Уведомление;
	
	Уведомление.action_id = Уведомление.action_id;
	
	ИнтеграцияМДЛП.ЗаполнитьСвойствоXDTO(Уведомление, "subject_id", Шапка.ИдентификаторМестаДеятельности, СообщениеКПередаче);
	ИнтеграцияМДЛП.УстановитьДатуСЧасовымПоясом(Уведомление, "operation_date", Шапка.Дата, УстановленныеДаты, СообщениеКПередаче);
	
	ИнтеграцияМДЛП.ЗаполнитьСвойствоXDTO(Уведомление, "doc_num", Шапка.НомерДокумента, СообщениеКПередаче);
	ИнтеграцияМДЛП.ЗаполнитьСвойствоXDTO(Уведомление, "doc_date", Формат(Шапка.ДатаДокумента, "ДФ=dd.MM.yyyy"), СообщениеКПередаче);
	
	Уведомление.order_details = ИнтеграцияМДЛП.ОбъектXDTOПоИмениСвойства(Уведомление, "order_details");
	Для Каждого Строка Из Товары Цикл
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Уведомление.order_details, "union") Тогда
			НоваяСтрока = ИнтеграцияМДЛП.ОбъектXDTOПоИмениСвойства(Уведомление.order_details, "union");
			ИнтеграцияМДЛП.ЗаполнитьСвойствоXDTO(НоваяСтрока, "sgtin", Строка.НомерКИЗ, СообщениеКПередаче);
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НоваяСтрока, "sold_part") Тогда
				Если НоваяСтрока.Тип().Свойства.Получить("sold_part").Тип.Имя = "decimal_type" Тогда
					Если ЗначениеЗаполнено(Строка.ДоляОтВторичнойУпаковки) Тогда
						ДоляУпаковки = Строка.ДоляОтВторичнойУпаковки;
					ИначеЕсли ЗначениеЗаполнено(Строка.КоличествоПервичныхУпаковок) Тогда
						ДоляУпаковки = Окр(Строка.КоличествоПервичныхУпаковок / Строка.КоличествоПервичныхУпаковокВоВторичной, 5);
					Иначе
						ДоляУпаковки = 0;
					КонецЕсли;
					ИнтеграцияМДЛП.ЗаполнитьСвойствоXDTO(НоваяСтрока, "sold_part", ДоляУпаковки, СообщениеКПередаче);
				ИначеЕсли ЗначениеЗаполнено(Строка.КоличествоПервичныхУпаковок) Тогда
					ДоляУпаковки = СтрШаблон("%1/%2", Формат(Строка.КоличествоПервичныхУпаковок, "ЧГ="), Формат(Строка.КоличествоПервичныхУпаковокВоВторичной, "ЧГ="));
					ИнтеграцияМДЛП.ЗаполнитьСвойствоXDTO(НоваяСтрока, "sold_part", ДоляУпаковки, СообщениеКПередаче);
				КонецЕсли;
			КонецЕсли;
			Уведомление.order_details.union.Добавить(НоваяСтрока);
		Иначе
			ИнтеграцияМДЛП.ЗаполнитьСвойствоXDTO(Уведомление.order_details, "sgtin", Строка.НомерКИЗ, СообщениеКПередаче);
		КонецЕсли;
	КонецЦикла;
	
	ИнтеграцияМДЛП.ПроверитьОбъектXDTO(ПередачаДанных, СообщениеКПередаче);
	
	ТекстСообщения = ИнтеграцияМДЛП.ОбъектXDTOВXML(ПередачаДанных, ИмяТипа, ПространствоИмен);
	ТекстСообщения = ИнтеграцияМДЛП.ПреобразоватьВременныеДаты(УстановленныеДаты, ТекстСообщения);
	
	Возврат ТекстСообщения;
	
КонецФункции

Функция УведомлениеОВыдачеВОтделенияДляОказанияМедицинскойПомощиСКЗКМ(Шапка, Товары, СообщениеКПередаче)
	
	РеквизитыДокумента = ТранспортМДЛПРВКлиентСервер.ПустаяСтруктураДынныхТребованияНакладной();
	РеквизитыДокумента.НомерДокумента = Шапка.НомерДокумента;
	РеквизитыДокумента.ДатаДокумента = Шапка.ДатаДокумента;
	
	Для Каждого Строка Из Товары Цикл
		ДанныеМарки = ТранспортМДЛПРВКлиентСервер.ПустаяСтруктураМарки();
		ДанныеМарки.НомерКИЗ = Строка.НомерКИЗ;
		Если ЗначениеЗаполнено(Строка.КоличествоПервичныхУпаковок) Тогда
			ДанныеМарки.ДоляОтВторичнойУпаковки = СтрШаблон(
				"%1/%2",
				Формат(Строка.КоличествоПервичныхУпаковок, "ЧГ="),
				Формат(Строка.КоличествоПервичныхУпаковокВоВторичной, "ЧГ="));
		КонецЕсли;
		РеквизитыДокумента.Марки.Добавить(ДанныеМарки);
	КонецЦикла;
	
	Возврат ТранспортМДЛПКлиентСервер.ПреобразоватьЗначениеВJSON(РеквизитыДокумента);
	
КонецФункции

Функция ОпределитьУведомлениеОВыдаче(ДанныеДокумента)
	
	ИнформацияОбУстройстве = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента, "device_info");
	ИдентификаторЗапроса = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ИнформацияОбУстройстве, "skzkm_report_id");
	ИдентификаторМестаДеятельности = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента, "subject_id");
	
	Отбор = Новый Структура;
	Отбор.Вставить("ТипСообщения", Перечисления.ТипыСообщенийМДЛП.Исходящее);
	Отбор.Вставить("Операция", Перечисления.ОперацииОбменаМДЛП.ПередачаДанных_ВыдачаЛПДляОказанияМедицинскойПомощиСКЗКМ);
	Отбор.Вставить("ИдентификаторКвитанции", ИдентификаторЗапроса);
	Сообщение = ИнтеграцияМДЛП.НайтиСообщениеОбмена(Отбор);
	
	Если ЗначениеЗаполнено(Сообщение) Тогда
		Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сообщение, "ВладелецФайла"));
	КонецЕсли;
	
	СерийныйНомерМБ = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ИнформацияОбУстройстве, "device_id");
	
	Если ИнтеграцияМДЛП.РегистраторИспользуетсяВАвтономномРежиме(СерийныйНомерМБ) Тогда
		Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПолучитьСсылку());
	КонецЕсли;
	
	// По данным, полученным из МДЛП, определяем ссылку на уведомление,
	// если сообщение по каким-то причиным не было зафиксировано в базе.
	ДатаОперации                   = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента, "operation_date", ТекущаяДатаСеанса());
	ДанныеПотребительскихУпаковок  = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента.order_details, "union", Новый Массив);
	
	НомераПотребительскихУпаковок = Новый ТаблицаЗначений;
	НомераПотребительскихУпаковок.Колонки.Добавить("НомерКИЗ"                              , Метаданные.ОпределяемыеТипы.НомерУпаковкиМДЛП.Тип);
	НомераПотребительскихУпаковок.Колонки.Добавить("КоличествоПервичныхУпаковокВоВторичной", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(5, 0, ДопустимыйЗнак.Неотрицательный)));
	НомераПотребительскихУпаковок.Колонки.Добавить("КоличествоПервичныхУпаковок"           , Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(5, 0, ДопустимыйЗнак.Неотрицательный)));
	Для Каждого ДанныеУпаковки Из ДанныеПотребительскихУпаковок Цикл
		НомерУпаковки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеУпаковки, "sgtin");
		Если ЗначениеЗаполнено(НомерУпаковки) Тогда
			Строка = НомераПотребительскихУпаковок.Добавить();
			Строка.НомерКИЗ = НомерУпаковки;
			ЧастичноеВыбытие = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеУпаковки, "sold_part", "");
			Если Не ПустаяСтрока(ЧастичноеВыбытие) Тогда
				Части = СтрРазделить(ЧастичноеВыбытие, "/");
				Строка.КоличествоПервичныхУпаковокВоВторичной = Число(Части[1]);
				Строка.КоличествоПервичныхУпаковок = Число(Части[0]);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	НомераПотребительскихУпаковок.НомерКИЗ                                КАК НомерКИЗ,
	|	НомераПотребительскихУпаковок.КоличествоПервичныхУпаковокВоВторичной  КАК КоличествоПервичныхУпаковокВоВторичной,
	|	НомераПотребительскихУпаковок.КоличествоПервичныхУпаковок             КАК КоличествоПервичныхУпаковок
	|ПОМЕСТИТЬ НомераПотребительскихУпаковок
	|ИЗ
	|	&НомераПотребительскихУпаковок КАК НомераПотребительскихУпаковок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Упаковки.Ссылка       КАК Документ,
	|	Упаковки.Ссылка.Дата  КАК Дата,
	|	Упаковки.НомерКИЗ     КАК НомерКИЗ
	|ПОМЕСТИТЬ УпаковкиВДокументахСтрогое
	|ИЗ
	|	НомераПотребительскихУпаковок КАК НомераПотребительскихУпаковок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			Документ.УведомлениеОВыдачеВОтделенияМДЛП.НомераУпаковок КАК Упаковки
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|					Документ.УведомлениеОВыдачеВОтделенияМДЛП.Товары КАК Товары
	|				ПО
	|					Упаковки.Ссылка = Товары.Ссылка
	|					И Упаковки.ИдентификаторСтроки = Товары.ИдентификаторСтроки
	|		ПО
	|			Упаковки.НомерКИЗ = НомераПотребительскихУпаковок.НомерКИЗ
	|			И Упаковки.КоличествоПервичныхУпаковок = НомераПотребительскихУпаковок.КоличествоПервичныхУпаковок
	|			И Товары.КоличествоПервичныхУпаковокВоВторичной = НомераПотребительскихУпаковок.КоличествоПервичныхУпаковокВоВторичной
	|ГДЕ
	|	НЕ Упаковки.СостояниеПодтверждения В (&КонечныеСостояния)
	|	И Упаковки.Ссылка.МестоДеятельности.Идентификатор = &ИдентификаторМестаДеятельности
	|	И Упаковки.Ссылка.Дата <= &ДатаОперации
	|	И Упаковки.Ссылка.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Упаковки.Ссылка       КАК Документ,
	|	Упаковки.Ссылка.Дата  КАК Дата,
	|	Упаковки.НомерКИЗ     КАК НомерКИЗ
	|ПОМЕСТИТЬ УпаковкиВДокументахНестрогое
	|ИЗ
	|	НомераПотребительскихУпаковок КАК НомераПотребительскихУпаковок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			Документ.УведомлениеОВыдачеВОтделенияМДЛП.НомераУпаковок КАК Упаковки
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|					Документ.УведомлениеОВыдачеВОтделенияМДЛП.Товары КАК Товары
	|				ПО
	|					Упаковки.Ссылка = Товары.Ссылка
	|					И Упаковки.ИдентификаторСтроки = Товары.ИдентификаторСтроки
	|		ПО
	|			Упаковки.НомерКИЗ = НомераПотребительскихУпаковок.НомерКИЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			УпаковкиВДокументахСтрогое КАК УпаковкиВДокументахСтрогое
	|		ПО
	|			УпаковкиВДокументахСтрогое.Документ = Упаковки.Ссылка
	|ГДЕ
	|	НЕ Упаковки.СостояниеПодтверждения В (&КонечныеСостояния)
	|	И Упаковки.Ссылка.МестоДеятельности.Идентификатор = &ИдентификаторМестаДеятельности
	|	И Упаковки.Ссылка.Дата <= &ДатаОперации
	|	И Упаковки.Ссылка.Проведен
	|	И УпаковкиВДокументахСтрогое.Документ ЕСТЬ NULL
	|;
	| 
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	УпаковкиВДокументах.Документ КАК Документ,
	|	УпаковкиВДокументах.Дата     КАК Дата
	|ИЗ
	|	УпаковкиВДокументахСтрогое КАК УпаковкиВДокументах
	|СГРУППИРОВАТЬ ПО
	|	УпаковкиВДокументах.Документ,
	|	УпаковкиВДокументах.Дата
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ УпаковкиВДокументах.НомерКИЗ) = &КоличествоПотребительскихУпаковок
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	УпаковкиВДокументах.Документ КАК Документ,
	|	УпаковкиВДокументах.Дата     КАК Дата
	|ИЗ
	|	УпаковкиВДокументахНестрогое КАК УпаковкиВДокументах
	|СГРУППИРОВАТЬ ПО
	|	УпаковкиВДокументах.Документ,
	|	УпаковкиВДокументах.Дата
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ УпаковкиВДокументах.НомерКИЗ) = &КоличествоПотребительскихУпаковок
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ,
	|	Документ УБЫВ
	|");
	
	КонечныеСостояния = Новый Массив;
	КонечныеСостояния.Добавить(Перечисления.СостоянияПодтвержденияМДЛП.ПринятоГИСМ);
	
	Запрос.УстановитьПараметр("КонечныеСостояния"                , КонечныеСостояния);
	Запрос.УстановитьПараметр("ИдентификаторМестаДеятельности"   , ИдентификаторМестаДеятельности);
	Запрос.УстановитьПараметр("НомераПотребительскихУпаковок"    , НомераПотребительскихУпаковок);
	Запрос.УстановитьПараметр("КоличествоПотребительскихУпаковок", НомераПотребительскихУпаковок.Количество());
	Запрос.УстановитьПараметр("ДатаОперации"                     , ДатаОперации);
	
	ДокументыСУпаковками = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Документ");
	Если Не ЗначениеЗаполнено(ДокументыСУпаковками) Тогда
		ДокументыСУпаковками.Добавить(ПолучитьСсылку());
	КонецЕсли;
	
	Возврат ДокументыСУпаковками;
	
КонецФункции

Процедура ЗагрузитьУведомлениеОВыдаче(ДанныеДокумента, ДокументСсылка)
	
	Если ОбщегоНазначения.СсылкаСуществует(ДокументСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторОрганизации = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента, "subject_id");
	НомерДокумента = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента, "doc_num");
	ДатаДокумента = СтроковыеФункцииКлиентСервер.СтрокаВДату(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента, "doc_date"));
	
	Документ = СоздатьДокумент();
	Документ.УстановитьСсылкуНового(ДокументСсылка);
	Документ.Дата = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента, "operation_date", ТекущаяДатаСеанса());
	ИнтеграцияМДЛП.ПолучитьОрганизациюМестоДеятельностиПоИдентификатору(ИдентификаторОрганизации, Документ.Организация, Документ.МестоДеятельности);
	Документ.НомерДокумента = НомерДокумента;
	Документ.ДатаДокумента = ДатаДокумента;
	Документ.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.Передано;
	Документ.ПередачаСведенийЧерезСКЗКМ = Истина;
	Документ.ДанныеПолученыИзМДЛП = Истина;
	
	Для Каждого Товар Из ДанныеДокумента.order_details.union Цикл
		
		КоличествоПервичныхУпаковокВоВторичной = 0;
		КоличествоПервичныхУпаковок = 0;
		
		ЧастичноеВыбытие = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Товар, "sold_part", "");
		Если Не ПустаяСтрока(ЧастичноеВыбытие) Тогда
			Части = СтрРазделить(ЧастичноеВыбытие, "/");
			КоличествоПервичныхУпаковокВоВторичной = Число(Части[1]);
			КоличествоПервичныхУпаковок = Число(Части[0]);
		КонецЕсли;
		
		GTIN = Лев(Товар.sgtin, 14);
		НайденныеСтроки = Документ.Товары.НайтиСтроки(Новый Структура("GTIN", GTIN));
		СтрокаТовара = Неопределено;
		Если НайденныеСтроки.Количество() > 0 Тогда
			Если КоличествоПервичныхУпаковокВоВторичной = 0 Тогда
				СтрокаТовара = НайденныеСтроки[0];
			Иначе
				Для Каждого Строка Из НайденныеСтроки Цикл
					Если Строка.КоличествоПервичныхУпаковокВоВторичной = КоличествоПервичныхУпаковокВоВторичной Тогда
						СтрокаТовара = Строка;
						Прервать;
					КонецЕсли;
					Если СтрокаТовара = Неопределено И Строка.КоличествоПервичныхУпаковокВоВторичной = 0 Тогда
						СтрокаТовара = Строка;
					КонецЕсли;
				КонецЦикла;
				Если СтрокаТовара <> Неопределено Тогда
					СтрокаТовара.КоличествоПервичныхУпаковокВоВторичной = КоличествоПервичныхУпаковокВоВторичной;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
			
		Если СтрокаТовара = Неопределено Тогда
			СтрокаТовара = Документ.Товары.Добавить();
			СтрокаТовара.GTIN = GTIN;
			СтрокаТовара.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
			СтрокаТовара.КоличествоПервичныхУпаковокВоВторичной = КоличествоПервичныхУпаковокВоВторичной;
		КонецЕсли;
		
		СтрокаТовара.Количество = СтрокаТовара.Количество + 1;
		
		СтрокаУпаковки = Документ.НомераУпаковок.Добавить();
		СтрокаУпаковки.ИдентификаторСтроки = СтрокаТовара.ИдентификаторСтроки;
		СтрокаУпаковки.НомерКИЗ = Товар.sgtin;
		СтрокаУпаковки.КоличествоПервичныхУпаковок = КоличествоПервичныхУпаковок;
		
	КонецЦикла;
	
	ИнтеграцияМДЛППереопределяемый.ПриЗагрузкеУведомленияОВыбытии(Документ);
	
	РезультатОбработки = ДанныеДокумента.Квитанция.result.operation_result;
	Если РезультатОбработки = "Accepted" Или РезультатОбработки = "Partial" Тогда
		Документ.Проведен = Истина;
		// Упаковки будут зарезервированы при проведении
		Документ.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.КПередаче;
	Иначе
		// Резервировать не требуется, так как отказано в регистрации сведений.
		Документ.СостояниеПодтверждения = Перечисления.СостоянияПодтвержденияМДЛП.Передано;
	КонецЕсли;
	
	ИнтеграцияМДЛП.ЗаписатьДокумент(Документ);
	
КонецПроцедуры

#Область Серии

// Имена реквизитов, от значений которых зависят параметры указания серий
//
// Возвращаемое значение:
//  Строка - имена реквизитов, перечисленные через запятую
//
Функция ИменаРеквизитовДляЗаполненияПараметровУказанияСерий() Экспорт
	
	Возврат ГосударственныеИнформационныеСистемыПереопределяемый.ИменаРеквизитовДляЗаполненияПараметровУказанияСерий(ПустаяСсылка().Метаданные());
	
КонецФункции

// Возвращает параметры указания серий для товаров, указанных в документе.
//
// Параметры:
//  Объект - Структура - структура значений реквизитов объекта, необходимых для заполнения параметров указания серий.
//
// Возвращаемое значение:
//  Структура
//
Функция ПараметрыУказанияСерий(Объект) Экспорт
	
	Возврат ГосударственныеИнформационныеСистемыПереопределяемый.ПараметрыУказанияСерий(ПустаяСсылка().Метаданные(), Объект);
	
КонецФункции

// Возвращает текст запроса для расчета статусов указания серий
//
// Параметры:
//  ПараметрыУказанияСерий - Структура
//
// Возвращаемое значение:
//  Строка - текст запроса
//
Функция ТекстЗапросаЗаполненияСтатусовУказанияСерий(ПараметрыУказанияСерий) Экспорт
	
	Возврат ГосударственныеИнформационныеСистемыПереопределяемый.ТекстЗапросаЗаполненияСтатусовУказанияСерий(ПустаяСсылка().Метаданные(), ПараметрыУказанияСерий);
	
КонецФункции

#КонецОбласти

#Область Отчеты

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции Подключаемые.СоздатьКоллекциюКомандОтчетов
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, НастройкиФормы) Экспорт
	
	ГосударственныеИнформационныеСистемыПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры

#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

// Сформировать печатные формы объектов.
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую.
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
//
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ОбновлениеИнформационнойБазыМДЛП.ЗарегистрироватьДокументыДляЗаполненияМестДеятельности(ПустаяСсылка().Метаданные().ПолноеИмя(), Параметры);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ОбновлениеИнформационнойБазыМДЛП.ЗаполнитьМестаДеятельностиВДокументах(ПустаяСсылка().Метаданные().ПолноеИмя(), Параметры);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
